maslow_data = [
    {"stage": "1단계", "name": "생리적 욕구 (Physiology)", "content": "매슬로우 욕구 단계의 기초에 해당하며, 인간 생존을 위한 생물학적 구성 요소이다.", "example": "공기, 물, 음식, 온기, 의복, 생식, 보호소, 수면"},
    {"stage": "2단계", "name": "안전의 욕구 (Safety)", "content": "신체적 안전이 결여된 상황이나 경제적 안전이 결여된 상황에서 나타난다.", "example": "건강, 개인적 안전, 정서적 안전, 재정적 안전"},
    {"stage": "3단계", "name": "애정·소속 욕구 (Love/Belonging)", "content": "인간은 크고 작은 사회적 집단에서 소속감과 수용에 대한 정서적 욕구를 가지고 있다.", "example": "가족, 우정, 친밀감, 신뢰, 수용, 사랑과 애정을 주고 받는 것"},
    {"stage": "4단계", "name": "존중 욕구 (Esteem)", "content": "존중은 한 개인에 대한 존경과 감탄을 의미하지만, 동시에 '자존감과 타인의 존중'도 포함된다.", "example": "지위, 명성, 능력, 자신감, 독립"},
    {"stage": "5단계", "name": "자아 실현 욕구 (Self-actualization)", "content": "개인이 자신의 잠재력을 완전히 실현하는 것을 의미한다.", "example": "파트너 찾기, 부모 역할 수행, 재능과 능력의 활용 및 발전, 목표 추구" }
]

