maslow_data = [
    {"stage": "1단계", "name": "생리적 욕구 (Physiology)", "content": "매슬로우 욕구 단계의 기초에 해당하며, 인간 생존을 위한 생물학적 구성 요소이다.", "example": "공기, 물, 음식, 온기, 의복, 생식, 보호소, 수면"},
    {"stage": "2단계", "name": "안전의 욕구 (Safety)", "content": "신체적 안전이 결여된 상황이나 경제적 안전이 결여된 상황에서 나타난다.", "example": "건강, 개인적 안전, 정서적 안전, 재정적 안전"},
    {"stage": "3단계", "name": "애정·소속 욕구 (Love/Belonging)", "content": "인간은 크고 작은 사회적 집단에서 소속감과 수용에 대한 정서적 욕구를 가지고 있다.", "example": "가족, 우정, 친밀감, 신뢰, 수용, 사랑과 애정을 주고 받는 것"},
    {"stage": "4단계", "name": "존중 욕구 (Esteem)", "content": "존중은 한 개인에 대한 존경과 감탄을 의미하지만, 동시에 '자존감과 타인의 존중'도 포함된다.", "example": "지위, 명성, 능력, 자신감, 독립"},
    {"stage": "5단계", "name": "자아 실현 욕구 (Self-actualization)", "content": "개인이 자신의 잠재력을 완전히 실현하는 것을 의미한다.", "example": "파트너 찾기, 부모 역할 수행, 재능과 능력의 활용 및 발전, 목표 추구" }
]




            <h1>욕구 이론에 대한 나의 생각</h1>
            <p>매슬로우 욕구 이론은 5단계로 나누어져 하위 욕구를 채워야만 상위 욕구로 나아갈 수 있다는 것이다. 
            <br>욕구를 나눈 큰 틀에 있어서는 많은 부분 동의한다. 그리고 생리적 욕구가 무조건 기초, 첫번째가 되어야 한다는 것도 전적으로 동의한다. 하지만 이 이론이 나온 것이 1940년대인 것을 생각하면 역시 현대와는 맞지 않다고 생각한다. 
            <br>이 이론을 읽으면서 한 가지 생각이 났다. 불우한 환경에서 자란 사람들 중 몇 몇은 자신의 환경을 벗어나기 위해서 엄청난 노력을 한다. 내 생각에 그 사람들은 안전 욕구, 애정·소속 욕구, 존중 욕구에 대해서는 충분한 만족감을 느끼지 못 할 것이다. 그럼에도 그들은 환경을 벗어나려는 결핍 욕구와 그 속에서 성공하려는 자신의 자아 실현 욕구가 동시에 발현된다. 
            <br>현 시대에서 분명한 것은 욕구가 한 단계, 한 단계 일어나는 것이 아닌 피라미드와 상관 없이 복합적으로 일어난다는 것이다. 또한 본인의 욕구로 우선 순위가 바뀌기도 한다. 요즘 안전을 포기하고, 남들의 시선을 신경 쓰지 않고 본인의 자아 실현만을 위해 행동하는 사람들을 찾아 보기 정말 쉽다. 
            <br>이처럼 매슬로우의 욕구 이론은 현대와 어울린다고 하기에는 조금 무리가 있다.</p>